&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  ОстатокВКассе=ПолучитьОстаток();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
  ОстатокВКассе=ПолучитьОстаток();
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаток()

    //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
  // Данный фрагмент построен конструктором.
  // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
  
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  КассаОстатки.СуммаОстаток КАК СуммаОстаток
    |ИЗ
    |  РегистрНакопления.Касса.Остатки КАК КассаОстатки";
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  Если ВыборкаДетальныеЗаписи.Следующий() Тогда
    Возврат ВыборкаДетальныеЗаписи.СуммаОстаток
  Иначе
    Возврат 0
  КонецЕсли;
  
  //}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции // ПолучитьОстаток()